### DB 접속하기

In [70]:
from sqlalchemy import create_engine, text
from pandas import DataFrame

config = {
    'username' : 'root',
    'password' : '1234',
    'hostname' : 'localhost',
    'port' : 9090,
    'database' : 'myschool',
    'charset' : 'utf8mb4'
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)
print(con_str)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4

In [71]:
try:
    engine = create_engine(con_str)
    conn = engine.connect()
    print("Database connect success")
except Exception as e:
    print("Database connect fail", e)

Database connect success

In [13]:
sql = text("SELECT id, name, grade, department_id From students where id = 10101")

try:
    # SQL문 실행 결과 객체 받기
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

#SQL 문 실행 결과를 딕셔너리를 포함하는 리스트 형태로 변환
resultset = result.mappings().all()
print(resultset)

[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

In [6]:
student_id = input("검색할 학번을 입력하세요")

#sql문 안에서는 변수로 치환할 부분을 ':변수명' 형식으로 처리
sql = text("SELECT id, name, grade, department_id from students where id = :student_id")
print(sql)
#SQL문의 물음표를 치환할 값을 딕셔너리로 묶음 (물음표 순서에 따라 조합)
params = {"student_id": student_id}

try:
    #SQL문을 실행해서 결과 객체 받기 -> 치환할 값에 대한 딕셔너리도 함께 전달
    result = conn.execute(sql, params)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

resultset = result.mappings().all()
print(resultset)

SELECT id, name, grade, department_id from students where id = :student_id
[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

### 다중 행 데이터 조회
여러 행을 반환하는 SQL문 실행

In [18]:
sql = text("Select id, dname, loc, phone, email from departments limit 0,5")

try:
    result=conn.execute(sql)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

resultset = result.mappings().all()
print(resultset)

[{'id': 101, 'dname': '컴퓨터공학과', 'loc': '공학관', 'phone': '051-123-4567', 'email': 'cs@myschool.ac.kr'}, {'id': 102, 'dname': '소프트웨어학과', 'loc': '공학관', 'phone': '051-124-4567', 'email': 'media@myschool.ac.kr'}, {'id': 201, 'dname': '전자공학과', 'loc': '공학관', 'phone': '051-125-4567', 'email': 'ee@myschool.ac.kr'}, {'id': 202, 'dname': '기계공학과', 'loc': '공학관', 'phone': '051-126-4567', 'email': 'me@myschool.ac.kr'}, {'id': 203, 'dname': '건축학과', 'loc': '건축관', 'phone': '051-127-4567', 'email': 'arch@myschool.ac.kr'}]

### 결과 집합 사용하기

반복문을 활용한 데이터 출력

In [19]:
print("총 %d건의 데이터 조회됨" %len(resultset))

tmpl = "학과번호: {id}, 학과이름: {dname}, 위치: {loc}, 연락처: {phone}, 이메일:{email}"

for row in resultset:
    print(tmpl.format(**row))

총 5건의 데이터 조회됨
학과번호: 101, 학과이름: 컴퓨터공학과, 위치: 공학관, 연락처: 051-123-4567, 이메일:cs@myschool.ac.kr
학과번호: 102, 학과이름: 소프트웨어학과, 위치: 공학관, 연락처: 051-124-4567, 이메일:media@myschool.ac.kr
학과번호: 201, 학과이름: 전자공학과, 위치: 공학관, 연락처: 051-125-4567, 이메일:ee@myschool.ac.kr
학과번호: 202, 학과이름: 기계공학과, 위치: 공학관, 연락처: 051-126-4567, 이메일:me@myschool.ac.kr
학과번호: 203, 학과이름: 건축학과, 위치: 건축관, 연락처: 051-127-4567, 이메일:arch@myschool.ac.kr

결과 집합을 표 형태로 변환

In [20]:
df1 = DataFrame(resultset)

print(df1)

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

데이터 프레임 사용 (쥬피터에서만 됨)

In [21]:
df2 = DataFrame(resultset)

df2

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

입력값에 따른 검색 결과 만들기

In [22]:
keyword = input("검색할 교수 이름을 입력하세요.")

sql = text("""Select
           p.id as 교수번호, name as 이름, position as 직급, sal as 급여,
           comm as 보직수당, hiredate as 입사일시, dname as 소속학과
           from professors p
           inner join departments d on p.department_id = d.id
           where name like concat('%', :keyword, '%')""")

try:
    result = conn.execute(sql, {"keyword":keyword})
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

resultset = result.mappings().all()
df = DataFrame(resultset)
df

   교수번호   급여  보직수당     소속학과   이름                입사일시   직급
0  9906  300  21.0  소프트웨어학과  김현주 2006-08-31 01:04:24   교수
1  9909  392  24.0    전자공학과  김정훈 2001-09-09 07:36:05   교수
2  9914  385   NaN     건축학과  김지아 2002-08-06 23:35:57  조교수
3  9926  253   NaN     심리학과  김정웅 2012-07-24 21:27:58  조교수

### 3. 데이터 입력/수정/삭제

데이터 입력

In [23]:
sql = text("""
           insert into students (
           name, user_id, grade, idnum, birthdate,phone,height,
           weight, email, gender, status, admission_date, department_id)
           Values (
           :name, :user_id, :grade, MD5(:idnum), :birthdate, :phone, :height,
           :weight, :email, :gender, :status, :admission_date, :department_id
           )
           """)

In [24]:
new_student = {
    "name" : '나신입', "user_id": 'newbie', "grade":1, "idnum":'9205171000000',
    "birthdate": '2024-03-15', "phone": '010-9876-5432', "height" : 175,
    "weight" :82, "email": 'newbie@myschool.ac.kr', "gender" : '남',
    "status" : '재학', "admission_date" : '2028-02-12', "department_id":101
}

try:
    result = conn.execute(sql, new_student) #SQL문 실행하기 -> 자동 트랜젝션
    affected_rows = result.rowcount         #저장된 행의 수
    conn.commit()                           #변경사항을 데이터베이스에 영구 저장

    #생성된 PK값 추출하기
    pk_result = conn.execute(text("SELECT LAST_INSERT_ID()"))
    pk = pk_result.scalar()
except Exception as e:
    print("SQL Error:", e)
    conn.rollback()                         #오류 발생 시 변경사항 철회
    raise SystemExit                        #코드 진행 중단

print("저장된 행의 수: ", affected_rows, " , 신규 학생 ID:", pk)

저장된 행의 수:  1  , 신규 학생 ID: 10181

데이터 수정

In [26]:
sql = text("update students set phone=:phone, email=:email where id=:id")

params = {"phone" : "010-1234-5678", "email": "jinwoo.h@myschool.ac.kr", "id":10102}

try:
    result = conn.execute(sql,params)
    conn.commit()
except Exception as e:
    print(f"데이터 수정 오류: {e}")
    conn.rollback()
    raise SystemExit

print("수정된 데이터 수:", result.rowcount)

수정된 데이터 수: 1

데이터 삭제

In [27]:
sql = text("delete from enrollments where student_id=:id")

params = {"id":10102}

try:
    result = conn.execute(sql, params)
    conn.commit()
except Exception as e:
    print(f"데이터 삭제 오류: {e}")
    conn.rollback()
    raise SystemExit

print("삭제된 데이터 수:", result.rowcount)

삭제된 데이터 수: 2

### 4.Pandas 활용 데이터 조회

- Python에서 데이터를 읽고 다듬고 분석하는 모든 과정의 중심에 있는 라이브러리
    - 표 형식(2차원) 데이터를 손쉽게 처리하고 분석 가능
        - Series : 1차원 데이터 (열 단위)
        - DataFrame : 2차원 데이터(행,열 구조, 엑셀 표와 유사)
    - 다양한 데이터 입출력 지원
        - Csv, Excel, SQL, JSON 등 다양한 포맷을 쉽게 일고 쓸 수 있음
    - 강력한 데이터 조작 기능 제공
        - 필터링, 그룹화, 결합, 정렬, 통계, 결측치 처리 등
    - Numpy 기반 고속 연산
        - 벡터화 연산으로 루프 없이 빠른 데이터 처리 가능
    - SQLAlchemy와 호환
        - pd.read_sql_query()로 DB 데이터를 직접 불러와 분석 가능

기본 데이터 조회
- 필요한 모듈 참조

In [ ]:
from pandas import read_sql

sql = text("select id, name, position, sal, comm from professors where sal >500")

try:
    #SQL문과 SQLAlchemy의 접속 객체를 파라미터로 전달하여 데이터프레임 즉시 생성
    df = read_sql(sql,conn)
except Exception as e:
    print("SQL Error:", e)
    raise SystemExit

df

     id name position      sal  comm
0  9902  허경희     전임강사      552   NaN
1  9903  전종수      조교수      508   NaN
2  9910  강영호      조교수      593   NaN
3  9915  이옥순       교수      548  22.0
4  9918  오미영      부교수      578   NaN
5  9928  이영길      조교수      526  14.0
6  9931  박태수      부교수      510   NaN
7  9932  최정훈      부교수  5200000   NaN
8  9933  박태수      부교수  5100000   NaN

검색 조건을 입력 받아서 직접 가져오기

In [29]:
min_height = int(input("키의 하한값을 입력하세요."))
max_height = int(input("키의 상한값을 입력하세요."))

sql = text("""
           select id, name, grade, height, weight, gender
           from students
           where height between :min and :max""")

try:
    df = read_sql(sql, conn, params={"min": min_height, "max": max_height})
except Exception as e:
    print("SQL Error:", e)
    raise SystemExit

df

       id name  grade  height  weight gender
0   10101  황진우      1     151      62      남
1   10102  서순옥      4     152      46      남
2   10110  성성민      3     153      59      남
3   10116  김정훈      4     150      61      남
4   10119  박은영      2     153      60      남
5   10124  최예지      3     154      77      남
6   10130  문지호      4     150      69      여
7   10132  전미영      1     153      82      여
8   10133  최현주      2     154      83      남
9   10136  김준혁      1     150      74      남
10  10143  윤정희      2     152      64      여
11  10156  이민영      3     155      60      여
12  10164  권영진      4     153      58      여
13  10171  배미정      2     151      84      남

검색 결과를 파일로 저장하기 (csv파일)

In [30]:
df.to_csv("학생목록.csv", encoding = "utf-8")

검색 결과를 파일로 저장하기(엑셀 파일)

In [31]:
df.to_excel("학생목록.xlsx")

### 연구과제
covid19.csv 파일을 이용하여 myschool db 안에 테이블을 만들고 직접 정의(csv파일 참고하여), 자동 증가 형식의 기본키 컬럼 id

In [ ]:
#covid19 파일 열어보기
import pandas as pd

data = pd.read_csv("./covid19.csv", encoding='euc-kr')
data

              날짜  서울시 일일 확진  서울시 일일 사망  전국 일일 확진  전국 일일 사망
0     2023-05-31     5987.0          6   24411.0        17
1     2023-05-30     3326.0          1   13529.0         7
2     2023-05-29     1393.0          1    6868.0         3
3     2023-05-28     1393.0          1    6868.0         3
4     2023-05-27     4078.0          0   17796.0         3
...          ...        ...        ...       ...       ...
1207  2020-02-09        0.0          0       0.0         0
1208  2020-02-08        0.0          0       0.0         0
1209  2020-02-07        0.0          0       0.0         0
1210  2020-02-06        0.0          0       0.0         0
1211  2020-02-05        0.0          0       0.0         0

[1212 rows x 5 columns]

In [ ]:
import csv

sql = text("""
           insert into covid19 (
           date_time, daily_covid_seoul, daily_covid_seoul_death,
           daily_covid_korea, daily_covid_korea_death
           ) Values (
           :date_time,:daily_covid_seoul,:daily_covid_seoul_death,
            :daily_covid_korea,:daily_covid_korea_death
           )
        """)

fin=open("./covid19.csv", "r", encoding="euc-kr")
data = csv.reader(fin)
print(data)

<_csv.reader object at 0x000001AECBEC6980>

In [105]:
# header = next(data)
# print(header)

for row in data:
    # print(row[0])
    date_time = row[0]
    daily_covid_seoul = row[1]
    daily_covid_seoul_death = row[2]
    daily_covid_korea = row[3]
    daily_covid_korea_death = row[4]
    params = {
        "date_time": date_time,
        "daily_covid_seoul": daily_covid_seoul,
        "daily_covid_seoul_death": daily_covid_seoul_death,
        "daily_covid_korea": daily_covid_korea,
        "daily_covid_korea_death": daily_covid_korea_death
    }
    try:
        result = conn.execute(sql, params)
        conn.commit()
    except Exception as e:
        print("SQL Error:", e)
        conn.rollback()
        raise SystemExit
fin.close()

년도/월별 서울시 확진자 합계, 사망자 합계, 전국 확진자 합계, 사망자 합계를 조회하는 SQL문을 Python으로 실행 후 결과를 엑셀 파일로 저장

In [2]:
from sqlalchemy import create_engine, text
from pandas import DataFrame
import pandas as pd

config = {
    'username' : 'root',
    'password' : '1234',
    'hostname' : 'localhost',
    'port' : 9090,
    'database' : 'myschool',
    'charset' : 'utf8mb4'
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)
print(con_str)

try:
    engine = create_engine(con_str)
    conn = engine.connect()
    print("Database connect success")
except Exception as e:
    print("Database connect fail", e)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4
Database connect success

In [3]:
sql = text("""select DATE_FORMAT(date_time, '%Y-%m') as 년도_월, 
           sum(daily_covid_seoul) as 서울시_확진자_합계, 
           sum(daily_covid_seoul_death) as 서울시_사망자_합계, 
           sum(daily_covid_korea) as 전국_확진자_합계, 
           sum(daily_covid_korea_death) as 전국_사망자_합계 
           from covid19 
           group by 년도_월""")
try:
    result = conn.execute(sql)
    resultset = result.mappings().all()
    df = pd.DataFrame(resultset)
except Exception as e:
    print("SQL Error:", e)
    raise SystemExit
df
# df.to_csv("년도_월별_코로나확진자_사망자_합계.csv")

       년도_월 서울시_사망자_합계  서울시_확진자_합계 전국_사망자_합계  전국_확진자_합계
0   2020-02          0         0.0         0        0.0
1   2020-03          0         0.0         0        0.0
2   2020-04          0         7.0         0       82.0
3   2020-05          0       228.0         0      709.0
4   2020-06          0       451.0         0     1335.0
5   2020-07          0       288.0         0     1530.0
6   2020-08          0      2267.0         0     5642.0
7   2020-09          0      1424.0         0     3865.0
8   2020-10          0       719.0         0     2713.0
9   2020-11          0      2802.0         0     7769.0
10  2020-12          0     10209.0         0    26554.0
11  2021-01          0      5168.0         0    17500.0
12  2021-02          0      4083.0         0    11493.0
13  2021-03          0      3803.0         0    13430.0
14  2021-04          0      5811.0         0    18938.0
15  2021-05          0      6080.0         0    18343.0
16  2021-06          0      6075.0         0    16626.0
17  2021-07          0     14377.0         0    41401.0
18  2021-08          0     15019.0         0    53121.0
19  2021-09          0     21148.0         0    59899.0
20  2021-10          0     19123.0         0    53449.0
21  2021-11          0     34711.0         0    82566.0
22  2021-12          0     70977.0         0   183680.0
23  2022-01          0     52140.0         0   215009.0
24  2022-02         36    498842.0         0  2288947.0
25  2022-03       1158   1983383.0      5343  9962387.0
26  2022-04       1019    722562.0      6564  4143305.0
27  2022-05        239    135270.0      1382   860022.0
28  2022-06         64     49289.0       371   256037.0
29  2022-07         80    312023.0       500  1417511.0
30  2022-08        259    583610.0      1717  3472043.0
31  2022-09        258    270218.0      1642  1523764.0
32  2022-10        117    159869.0       771   789036.0
33  2022-11        205    306653.0      1332  1541960.0
34  2022-12        255    366337.0      1650  1961255.0
35  2023-01        197    201493.0      1293  1110809.0
36  2023-02         85     60021.0       538   338397.0
37  2023-03         43     74556.0       325   350168.0
38  2023-04         82    178710.0       430   708206.0
39  2023-05        131    243509.0       586  1019596.0

강사님 답안 버전

# [LAB-09] 데이터베이스 프로그래밍 (연구과제)

## #01. 데이터베이스 테이블 구성
```sql
use myschool;

create table covid19_new(
    id int not null auto_increment comment '일련번호',
    date DATE not null comment '날짜',
    seoul_confirm int not null default 0 comment '서울시 확진자 수',
    seoul_death int not null default 0 comment '서울시 사망자 수',
    wide_confirm int not null default 0 comment '전국 확진자 수',
    wide_death int not null default 0 comment '전국 사망자 수',
    primary key(id)
) default charset utf8 collate utf8_bin comment '코로나19 일일 확진/사망자'
```

In [3]:
with open('covid19.csv', 'r', encoding='euc-kr') as f:
    csv = f.readlines()
csv[0:5]

['날짜,서울 일일 확진,서울 일일 사망,전국 일일 확진,전국 일일 사망\n',
 '2023-05-31,5987,6,24411,17\n',
 '2023-05-30,3326,1,13529,7\n',
 '2023-05-29,1393,1,6868,3\n',
 '2023-05-28,1393,1,6868,3\n']

##### #03. CSV 파일의 내용을 데이터베이스 테이블에 INSERT 하기

In [4]:
from sqlalchemy import create_engine, text

### 데이터베이스 접속하기

In [5]:
from sqlalchemy import create_engine, text
from pandas import DataFrame

config = {
    'username' : 'root',
    'password' : '1234',
    'hostname' : 'localhost',
    'port' : 9090,
    'database' : 'myschool',
    'charset' : 'utf8mb4'
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)
print(con_str)
try:
    engine = create_engine(con_str)
    conn = engine.connect()
    print("Database connect success")
except Exception as e:
    print("Database connect fail", e)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4
Database connect success

### 데이터 저장하기

In [8]:
sql = text(
    """
    insert into covid19_new(
    date,seoul_confirm,seoul_death,wide_confirm, wide_death
    )values(
    :date,:seoul_confirm,:seoul_death,:wide_confirm, :wide_death
    )
    """)

#csv 파일의 행 수 만큼 반복하면서 sql문 실행
try:
    for i, v in enumerate(csv):
        if i==0:
            continue
        # print(v)
        item = v.strip().split(",")
        for j in range(1,len(item)):
            if item[j].isnumeric():
                item[j] = int(item[j])
            else:
                item[j] = 0
        params= {
            "date":item[0], "seoul_confirm":item[1], "seoul_death":item[2],
            "wide_confirm":item[3], "wide_death":item[4]
        }
        # print(params)
        conn.execute(sql,params)
    conn.commit()
except Exception as e:
    print("SQL Error:", e)
    conn.rollback()
    raise SystemExit

In [12]:
import pandas as pd
sql = text(
    """
    select date, sum(seoul_confirm), sum(seoul_death), sum(wide_confirm), sum(wide_death) from covid19_new group by date
"""
)
try:
    result = conn.execute(sql)
    resultset = result.mappings().all()
    df = pd.DataFrame(resultset)
except Exception as e:
    print("SQL Error:", e)
    conn.rollback()
    raise SystemExit

df

,date,sum(seoul_confirm),sum(seoul_death),sum(wide_confirm),sum(wide_death)
0,2020-02-05,0,0,0,0
1,2020-02-06,0,0,0,0
2,2020-02-07,0,0,0,0
3,2020-02-08,0,0,0,0
4,2020-02-09,0,0,0,0
...,...,...,...,...,...
1207,2023-05-27,8156,0,35592,6
1208,2023-05-28,2786,2,13736,6
1209,2023-05-29,2786,2,13736,6
1210,2023-05-30,6652,2,27058,14
1211,2023-05-31,11974,12,48822,34